set_attribute input_pragma_keyword "cadence synopsys get2chip g2c fast ambit pragma"
include compile.rc

read_hdl -vhdl -lib work config.vhd
read_hdl -vhdl -lib work clkgen_de2.vhd
read_hdl -vhdl -lib work mypackage.vhd
read_hdl -vhdl -lib work sdctrl16.vhd
read_hdl -vhdl -lib work apblcd.vhd
read_hdl -vhdl -lib work leon3mp.vhd
elaborate leon3mp
